# pandas + MySQL

如何利用pandas连接mysql数据库，并且进行读写，以及一些基本的SQL操作呢？

## 本地对象输出到MySQL中

In [18]:
import pandas as pd
from MySQLdb import connect
from numpy import random as rand
from sqlalchemy import create_engine

In [19]:
# 使用sqlalchemy建立与数据库的连接
con = create_engine('mysql+mysqldb://root:duanzhongqu1234@localhost/test?charset=utf8')

In [20]:
df = pd.DataFrame({'x':rand.randn(10), 'y':rand.randn(10)},index=range(10))
df

          x         y
0  0.716362 -0.420895
1 -0.208963  0.415108
2  0.395773 -0.573600
3 -1.160819  1.116365
4  0.587607  0.136918
5  0.814304 -0.623190
6 -0.551349  0.510397
7  2.727698  0.974707
8  1.153908 -1.119855
9  0.764209 -0.645667

In [21]:
# 写入到数据库中去
pd.io.sql.to_sql(df, 'data', con, schema='test',if_exists='replace')

In [22]:
# 可以看出MySQL数据库中已经出现了data这个表
pd.read_sql('show tables',con)

  Tables_in_test
0           data

In [23]:
df2 = pd.DataFrame({'name':['Eric','Jim','Tom'], 'age':[20,23,34]})
df2

   age  name
0   20  Eric
1   23   Jim
2   34   Tom

In [24]:

pd.io.sql.to_sql(df2, 'tom', con, schema='test',if_exists='replace')

In [25]:
pd.read_sql('show tables', con)

  Tables_in_test
0           data
1            tom

In [26]:
pd.read_sql('select * from data', con)

   index         x         y
0      0  0.716362 -0.420895
1      1 -0.208963  0.415108
2      2  0.395773 -0.573600
3      3 -1.160819  1.116365
4      4  0.587607  0.136918
5      5  0.814304 -0.623190
6      6 -0.551349  0.510397
7      7  2.727698  0.974707
8      8  1.153908 -1.119855
9      9  0.764209 -0.645667

In [27]:
# 可以看到多出来一列index,因此可以将index指定为False
df2.to_sql('data',con,if_exists='replace',index=False)

In [28]:
pd.read_sql('select * from data', con)

   age  name
0   20  Eric
1   23   Jim
2   34   Tom

In [29]:
# 查看当前表格的属性
pd.read_sql('describe data', con)

  Field        Type Null Key Default Extra
0   age  bigint(20)  YES        None
1  name        text  YES        None

## 指定SQL列的数据类型
可以指定某一个列的类型
data.to_sql('data_dtype', engine, dtype={'Col_1': String})

## 读入表格
有read_sql_table和read_sql_query两种，但事实上可以使用高级函数read_sql来囊括二者

## SQL语句执行
如果想要单纯执行一段sql语句，因为有许多语句不返回对象，可以使用pandas.io中的sql方法

In [30]:
from pandas.io import sql
sql.execute('show tables', con)

In [31]:
sql.execute('select * from data', con)

## pymysql包

In [32]:
import pymysql as mysql

In [33]:
import pandas as pd
con = mysql.connect(host='localhost', user='root', passwd='duanzhongqu1234',db='test', charset='utf8')

In [34]:
pd.read_sql('show tables', con)

  Tables_in_test
0           data
1            tom

In [35]:
df=pd.read_sql('select * from data', con)
df

   age  name
0   20  Eric
1   23   Jim
2   34   Tom

In [36]:
df.columns=['年龄','姓名']
df

   年龄    姓名
0  20  Eric
1  23   Jim
2  34   Tom

In [37]:
df.to_sql?